In [10]:
import pandas as pd
import hvplot.pandas
from sqlalchemy import create_engine

In [11]:
engine = create_engine("postgresql://postgres:postgres@localhost:5432/sql_challenge")

In [12]:
query = "SELECT * FROM transaction, credit_card;"

In [13]:
transaction_df = pd.read_sql(query, engine)

In [19]:
transaction_df.head()

,id,date,amount,card,id_merchant,card,id_card_holder
0,222,2018-01-01 21:35:10,6.22,3561954487988605,69,3517111172421930,1
1,222,2018-01-01 21:35:10,6.22,3561954487988605,69,4761049645711555811,1
2,222,2018-01-01 21:35:10,6.22,3561954487988605,69,4866761290278198714,2
3,222,2018-01-01 21:35:10,6.22,3561954487988605,69,675911140852,2
4,222,2018-01-01 21:35:10,6.22,3561954487988605,69,30078299053512,3

In [21]:
merchant_df = transaction_df[['id_card_holder', 'amount', 'date']]
merchant_df.head()

   id_card_holder  amount                date
0               1    6.22 2018-01-01 21:35:10
1               1    6.22 2018-01-01 21:35:10
2               2    6.22 2018-01-01 21:35:10
3               2    6.22 2018-01-01 21:35:10
4               3    6.22 2018-01-01 21:35:10